Ran Plan for dir: `deployment/cloud` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # kubectl_manifest.sonarqube_secret will be created
+ resource "kubectl_manifest" "sonarqube_secret" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Secret"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "sonarqube-secret"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: sonarqube-secret
            type: Opaque
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.repo_gitops.github_repository_deploy_key.repository_deploy_key[0] will be created
+ resource "github_repository_deploy_key" "repository_deploy_key" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + key        = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDVTFXE0Kq2SAwBXjPKJEFDRFejHd1xZPwvzAJPlWlG1jFpybEvrUTErwdtdKNtyCXB+P2gSy5E78Vu7pwdN9X1bFzpDkCm5ZdaK/l6jesXSYqACV7sPTBby7yopLvGIkbWIx+0I/encnBHZwAkLMv2vF2FYwbx//XvQ6r7XkDgTIE7BvU7v8QeIbpN/LNQANuQ2we340G2BJYcOqcuEyQnBMFNphMcuJAXGx97xoQRISYvyUsbs46W+YWps6bN7mFwYwZiTtSWfm7sW8C20IoBDsVBaardkm7N06MLe0xsZ9VmyXSFDFPCC06lm+j72S3731FsjSGvepOBym3uZiax
        EOT
      + read_only  = false
      + repository = "fta_gitops"
      + title      = "fta_gitops-public-key"
    }

  # module.sonarqube.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "sonarqube"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fta-helm-sonarqube"
      + namespace                  = "sonarqube"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://SonarSource.github.io/helm-chart-sonarqube"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (sensitive value)
      + verify                     = false
      + version                    = "10.6.1+3163"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/cloud
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fcloud%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/cloud
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```